programming/linux/shell_scripting.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: Shell Scripting

* 脚本

Shell 脚本是保存了一组命令的 ASCII 文本文件，文件名不需要后缀，但通常为 =.sh= 。

** 执行

#+begin_src sh
sh <script> # sh 命令执行

<script> # 直接执行，需要：
         # 文件所在目录在 PATH 环境变量中
         # 文件有执行权限
#+end_src

** Shebang

指定用于解释脚本的程序。

#+begin_src sh
#!/bin/bash
#!/usr/bin/perl
#+end_src

** 退出状态码

#+CAPTION: 查看上一个命令（脚本）的退出状态码
#+begin_src sh
echo $?
#+end_src

#+CAPTION: 设定脚本的退出状态码
#+begin_src sh
exit <code>
#+end_src

#+CAPTION: 退出状态码参考值
| =0=   | 成功结束           |
|-------+--------------------|
| =1=   | 通用未知错误       |
|-------+--------------------|
| =2=   | 使用方式错误       |
|-------+--------------------|
| =126= | 不可执行（无权限） |
|-------+--------------------|
| =127= | 命令未找到         |
|-------+--------------------|
| =128= | 无效退出参数       |
|-------+--------------------|
| =130= | 通过 =Ctrl+C= 终止 |
|-------+--------------------|
| =255= | 状态码越界         |

* 变量

#+begin_src sh
<var>=<value> # 定义，= 两侧无空格

$var   # 引用
${var} # {} 帮助识别变量名
"$var" # "" 用于变量值包含空格时
#+end_src

变量名区分大小写。

** 环境变量

#+begin_src sh
set                    # 查看环境变量列表
echo $<VAR>            # 输出环境变量值
export <VAR>[=<value>] # 设置或显示环境变量
#+end_src

#+CAPTION: 默认环境变量
| =CDPATH=   | 由 =:= 分隔的目录列表，作为 =cd= 的搜多路径 |
|------------+---------------------------------------------|
| =HOME=     | 当前用户的主目录                            |
|------------+---------------------------------------------|
| =IFS=      | 文本分隔符                                  |
|------------+---------------------------------------------|
| =MAIL=     | 当前用户收件箱的文件名                      |
|------------+---------------------------------------------|
| =MAILPATH= | 由 =:= 分隔的当前用户收件箱的文件名列表     |
|------------+---------------------------------------------|
| =OPTARG=   | 保存 =getopts= 处理的选项的参数值           |
|------------+---------------------------------------------|
| =OPTIND=   | 保存 =getopts= 处理的选项个数               |
|------------+---------------------------------------------|
| =PATH=     | 由 =:= 分隔的 Shell 查找命令的目录列表      |
|------------+---------------------------------------------|
| =PS1=      | 命令行主提示符                              |
|------------+---------------------------------------------|
| =PS2=      | 命令行次提示符                              |
|------------+---------------------------------------------|
| =$=        | 当前 PID                                    |

*** =IFS=

Internal Field Separator (IFS)，默认为：空格、制表符、换行符。

#+CAPTION: 更改 IFS
#+begin_src sh
IFS.OLD=$IFS # 更改之前保存当前设置
IFS=$'\n'    # 指定一个分隔符
IFS=$'\n:;'  # 指定多个分隔符
IFS=$IFS.OLD # 设置回原值
#+end_src

#+CAPTION: 更改 IFS 用于遍历特殊字符分隔的字符串
#+begin_src sh
IFS.OLD=$IFS
IFS=":"
for dir in $PATH; do
    echo $dir
done
IFS=$IFS.OLD
#+end_src

*** =PATH=

#+CAPTION: 在登录脚本里设置自定义脚本的查找路径
#+begin_src sh
# ~/.bashrc
export PATH="$PATH:$HOME/.rvm/bin" # Ruby 脚本路径
#+end_src

* 类型
