programming/linux/shell_scripting.org
** 数组

#+CAPTION: 定义
#+begin_src sh
array=(val1 val2 ...) # 枚举
array=($(cat))        # 使用命令输出
#+end_src

#+CAPTION: 遍历
#+begin_src sh
for value in ${array[@]}; do
    ...
done
#+end_src

#+CAPTION: 分片
#+begin_src sh
${array[@]:<start>:<count>}
#+end_src

#+CAPTION: 替换字符
#+begin_src sh
${array[@]/<pattern>/<replacement>}
#+end_src

** 字符串

字符串实际上是字符数组。

#+CAPTION: 子字符串
#+begin_src sh
${<string>:<start>:<length>}
#+end_src

#+CAPTION: 示例：替换指定位置的字符
#+begin_src sh
foo="${foo:0:9}x${foo:10}"
#+end_src

#+CAPTION: 示例：删除最后一个字符
#+begin_src sh
foo=${foo%?}
#+end_src

* 表达式
** =[]= 条件判断

#+begin_src sh
if test <cond>
if [ <cond> ]  # 简写，方括号内两侧必须有空格

if [ <cond> ] && [ <cond> ] # 与
if [ <cond> ] || [ <cond> ] # 或
if [ ! <cond> ]             # 非
#+end_src

只能以命令的退出状态码是否为 0 进行判断。通过 =test= 表达式可以将其他的条件转换为退出状态码：如果条件成立，则 =test= 退出并返回状态码 0。

*** 数值比较

| =-eq= |   |
|-------+---|
| =-ne= |   |
|-------+---|
| =-gt= |   |
|-------+---|
| =-ge= |   |
|-------+---|
| =-lt= |   |
|-------+---|
| =-le= |   |

#+CAPTION: 示例
#+begin_src sh
while [ $i -lt 100 ]
...
#+end_src

#+CAPTION: 数值比较无法处理变量中存储的浮点值，需要用 =bc= ，示例：
#+begin_src sh
if [ $(echo "$var >= 0.1" | bc) -eq 1 ]; then
#+end_src

*** 字符串比较

| ~==~        |                       |
|-------------+-----------------------|
| ~!=~        |                       |
|-------------+-----------------------|
| =>= =<=     | 必须转义              |
|-------------+-----------------------|
| =-n $<var>= | 长度非 0              |
|-------------+-----------------------|
| =-z $<var>= | 长度为 0 或变量不存在 |

字母的大小顺序与 =sort= 不同：
- =test= 使用 ASCII 顺序，大写字母 < 小写字母。
- =sort= 使用系统本地化语言设置中的顺序，对于英语，小写字母 < 大写字母。

*** 文件比较

| =-e=                | 存在                             |
|---------------------+----------------------------------|
| =-s=                | 存在且非空                       |
|---------------------+----------------------------------|
| =-d= =-f=           | 存在且为目录、文件               |
|---------------------+----------------------------------|
| =-r= =-w= =-x=      | 存在且可读、可写、可执行         |
|---------------------+----------------------------------|
| =-O=                | 存在且属当前用户所有             |
|---------------------+----------------------------------|
| =-G=                | 存在且默认组与当前用户相同       |
|---------------------+----------------------------------|
| =<file> -nt <file>= | 第一个文件比第二个新（创建日期） |
| =<file> -ot <file>= | 第一个文件比第二个旧（创建日期） |

** =$()= 命令输出

#+begin_src sh
$(<command>)
#+end_src

当命令 A 的输出作为命令 B 的参数时，Shell 会创建一个 subshell 运行命令 A，存储它的输出用于运行命令 B。

** =$[]= 数学运算

#+begin_src sh
$[ <expr> ] # 括号内两侧可以无空格
            # 运算符不需要转义
#+end_src

#+CAPTION: 示例
#+begin_src sh
var1=1
var2=2
var3=$[ $var1 + $var2 ]
#+end_src

** =${}= 数组

#+CAPTION: 数组分片
#+begin_src sh

#+end_src

** =(())= 高级数学运算

可以用于 =if= 条件，或用于赋值的普通命令。

#+begin_src sh
if (( <expr> ))
(( <var> = <expr> ))
#+end_src

| =++= =--=                                     |            |
|-----------------------------------------------+------------|
| =**=                                          | 幂         |
|-----------------------------------------------+------------|
| =&&=  @@html:<code>&#124;&#124;</code>@@  =!= | 逻辑与或非 |
|-----------------------------------------------+------------|
| =&=  @@html:<code>&#124;</code>@@ =~=         | 位与或非   |
|-----------------------------------------------+------------|
| =<<= =>>=                                     | 位运算     |
  
运算符不需要转义。

** =[[]]= 字符串

提供针对字符串的高级特性，如正则表达式模式匹配。

#+begin_src sh
[[ <expr> ]]
#+end_src

#+CAPTION: 示例
#+begin_src sh
if [[ $USER == r* ]]
#+end_src

