programming/linux/shell_scripting.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 类型</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 数组</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<label class="org-src-name">定义</label>
<pre class="src src-sh"><span class="org-variable-name">array</span>=(val1 val2 ...) <span class="org-comment-delimiter"># </span><span class="org-comment">&#26522;&#20030;</span>
<span class="org-variable-name">array</span>=($(cat))        <span class="org-comment-delimiter"># </span><span class="org-comment">&#20351;&#29992;&#21629;&#20196;&#36755;&#20986;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">遍历</label>
<pre class="src src-sh"><span class="org-keyword">for</span> value<span class="org-keyword"> in</span> ${<span class="org-variable-name">array</span>[@]}; <span class="org-keyword">do</span>
    ...
<span class="org-keyword">done</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">分片</label>
<pre class="src src-sh">${<span class="org-variable-name">array</span>[@]:&lt;start&gt;:&lt;count&gt;}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">替换字符</label>
<pre class="src src-sh">${<span class="org-variable-name">array</span>[@]/&lt;pattern&gt;/&lt;replacement&gt;}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 字符串</h3>
<div class="outline-text-3" id="text-3-2">
<p>
字符串实际上是字符数组。
</p>

<div class="org-src-container">
<label class="org-src-name">子字符串</label>
<pre class="src src-sh">${&lt;string&gt;:&lt;start&gt;:&lt;length&gt;}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">示例：替换指定位置的字符</label>
<pre class="src src-sh"><span class="org-variable-name">foo</span>=<span class="org-string">"${foo:0:9}x${foo:10}"</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">示例：删除最后一个字符</label>
<pre class="src src-sh"><span class="org-variable-name">foo</span>=${<span class="org-variable-name">foo</span>%?}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 表达式</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <code>[]</code> 条件判断</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">if </span><span class="org-builtin">test</span> &lt;cond&gt;
<span class="org-keyword">if</span> [ &lt;cond&gt; ]  <span class="org-comment-delimiter"># </span><span class="org-comment">&#31616;&#20889;&#65292;&#26041;&#25324;&#21495;&#20869;&#20004;&#20391;&#24517;&#39035;&#26377;&#31354;&#26684;</span>

<span class="org-keyword">if</span> [ &lt;cond&gt; ] &amp;&amp; [ &lt;cond&gt; ] <span class="org-comment-delimiter"># </span><span class="org-comment">&#19982;</span>
<span class="org-keyword">if</span> [ &lt;cond&gt; ] || [ &lt;cond&gt; ] <span class="org-comment-delimiter"># </span><span class="org-comment">&#25110;</span>
<span class="org-keyword">if</span> [ <span class="org-negation-char">!</span> &lt;cond&gt; ]             <span class="org-comment-delimiter"># </span><span class="org-comment">&#38750;</span>
</pre>
</div>

<p>
只能以命令的退出状态码是否为 0 进行判断。通过 <code>test</code> 表达式可以将其他的条件转换为退出状态码：如果条件成立，则 <code>test</code> 退出并返回状态码 0。
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> 数值比较</h4>
<div class="outline-text-4" id="text-4-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>-eq</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>-ne</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-gt</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-ge</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-lt</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-le</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-sh"><span class="org-keyword">while</span> [ $<span class="org-variable-name">i</span> -lt 100 ]
...
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">数值比较无法处理变量中存储的浮点值，需要用 <code>bc</code> ，示例：</label>
<pre class="src src-sh"><span class="org-keyword">if</span> [ $(<span class="org-builtin">echo</span> <span class="org-string">"$var &gt;= 0.1"</span> | bc) -eq 1 ]; <span class="org-keyword">then</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> 字符串比较</h4>
<div class="outline-text-4" id="text-4-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>==</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>!=</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&gt;</code> <code>&lt;</code></td>
<td class="left">必须转义</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-n $&lt;var&gt;</code></td>
<td class="left">长度非 0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-z $&lt;var&gt;</code></td>
<td class="left">长度为 0 或变量不存在</td>
</tr>
</tbody>
</table>

<p>
字母的大小顺序与 <code>sort</code> 不同：
</p>
<ul class="org-ul">
<li><code>test</code> 使用 ASCII 顺序，大写字母 &lt; 小写字母。
</li>
<li><code>sort</code> 使用系统本地化语言设置中的顺序，对于英语，小写字母 &lt; 大写字母。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> 文件比较</h4>
<div class="outline-text-4" id="text-4-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>-e</code></th>
<th scope="col" class="left">存在</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>-s</code></td>
<td class="left">存在且非空</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-d</code> <code>-f</code></td>
<td class="left">存在且为目录、文件</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-r</code> <code>-w</code> <code>-x</code></td>
<td class="left">存在且可读、可写、可执行</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-O</code></td>
<td class="left">存在且属当前用户所有</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-G</code></td>
<td class="left">存在且默认组与当前用户相同</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&lt;file&gt; -nt &lt;file&gt;</code></td>
<td class="left">第一个文件比第二个新（创建日期）</td>
</tr>

<tr>
<td class="left"><code>&lt;file&gt; -ot &lt;file&gt;</code></td>
<td class="left">第一个文件比第二个旧（创建日期）</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <code>$()</code> 命令输出</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-sh">&lt;var&gt;=$(&lt;command&gt;)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <code>$[]</code> 数学运算</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-sh">$[ &lt;expr&gt; ] <span class="org-comment-delimiter"># </span><span class="org-comment">&#25324;&#21495;&#20869;&#20004;&#20391;&#21487;&#20197;&#26080;&#31354;&#26684;</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">&#36816;&#31639;&#31526;&#19981;&#38656;&#35201;&#36716;&#20041;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-sh"><span class="org-variable-name">var1</span>=1
<span class="org-variable-name">var2</span>=2
<span class="org-variable-name">var3</span>=$[ $<span class="org-variable-name">var1</span> + $<span class="org-variable-name">var2</span> ]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <code>${}</code> 数组</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<label class="org-src-name">数组分片</label>
<pre class="src src-sh"></pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> <code>(())</code> 高级数学运算</h3>
<div class="outline-text-3" id="text-4-5">
<p>
可以用于 <code>if</code> 条件，或用于赋值的普通命令。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">if</span> (( &lt;expr&gt; ))
(( &lt;var&gt; = &lt;expr&gt; ))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>++</code> <code>--</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>**</code></td>
<td class="left">幂</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&amp;&amp;</code>  <code>&#124;&#124;</code>  <code>!</code></td>
<td class="left">逻辑与或非</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&amp;</code>  <code>&#124;</code> <code>~</code></td>
<td class="left">位与或非</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&lt;&lt;</code> <code>&gt;&gt;</code></td>
<td class="left">位运算</td>
</tr>
</tbody>
</table>

<p>
运算符不需要转义。
</p>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> <code>[[]]</code> 字符串</h3>
<div class="outline-text-3" id="text-4-6">
<p>
提供针对字符串的高级特性，如正则表达式模式匹配。
</p>

<div class="org-src-container">

<pre class="src src-sh">[[ &lt;expr&gt; ]]
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-sh"><span class="org-keyword">if</span> [[ $<span class="org-variable-name">USER</span> == r* ]]
</pre>
</div>
</div>
</div>
