programming/linux/shell_scripting.org
** Glob 表达式

Shell 使用的、简化了的正则表达式。

| =*=             | 任意个任意字符     |
|-----------------+--------------------|
| =?=             | 任意一个字符       |
|-----------------+--------------------|
| =[<char>...]=   | 多个字符中任意一个 |
|-----------------+--------------------|
| =[<from>-<to>]= | 范围内的字符 |
|-----------------+--------------------|
| =\=             | 转义字符           |

* 语句
** =if=

#+begin_src sh
if [ <cond> ]
then
    ... # if 命令的退出状态码为 0
elif [ <cond> ]
then
    ...
else
    ... # if 命令的退出状态码非 0
fi
#+end_src

#+CAPTION: 简写
#+begin_src sh
if [ <cond> ]; then
    ...
fi
#+end_src

** =case=

#+begin_src sh
case $<var> in
    <val1> | <val2>) <cmd>;;
    <val3>) <cmd>;;
    *) <cmd>;; # 默认分支
esac
#+end_src

** =for=

#+begin_src sh
for <var> in <list>
do
    <cmd>
done
#+end_src

#+CAPTION: 简写
#+begin_src sh
for <var> in <list>; do
    <cmd>
done
#+end_src

*** 列表

#+CAPTION: 直接输入
#+begin_src sh
for var in a b c d # 默认分隔符为空格
                   # 单引号需要转义，或用双引号分隔
#+end_src

#+CAPTION: 从变量读取
#+begin_src sh
list='a b c d'
for var in $list
#+end_src

#+CAPTION: 从输出读取
#+begin_src sh
for var in `cat file`
#+end_src

#+CAPTION: 遍历目录
#+begin_src sh
for file in path/*; do      # 目录（文件）列表使用 glob 表达式
    if [ -d "$file" ]; then # 文件名中可能有空格，需用引号分隔

for file in path1/* path2/* # 可以使用多个表达式
#+end_src

*** C 风格 =for=

#+begin_src sh
for (( <var>=<start>; <cond>; <iter> ))
## 示例
for (( i=1; i<=10; i++ ))
#+end_src

- 给变量赋值可以有空格。
- 条件中的变量不以 =$= 开头。
- 迭代过程不是 =expr= 表达式格式。

#+CAPTION: 可以使用多个变量，但条件只能有一个：
#+begin_src sh
for (( a=1, b=10; a<=10; a++, b-- ))
#+end_src

*** 重定向输出

#+CAPTION: 结果重定向到文件：
#+begin_src sh
for ...
...
done > file
#+end_src

*** 示例

#+CAPTION: 数值补齐，0 到 10 补齐两位：
#+begin_src sh
for i in $(seq -f "%02g" 0 10)
#+end_src

** =while=

#+begin_src sh
while [<cond>]
do
    <cmd> # 测试退出状态码为 0 时执行
done
#+end_src

#+CAPTION: 使用多个测试
#+begin_src sh
while [<cond>]
    <cond> # 每个测试单独一行
#+end_src

- 只有最后一个测试的退出状态码会被用来判断循环的结束。
- 每次（包括最后一次）循环开始时，所有测试命令都会被执行。

** =until=

#+begin_src sh
until <cond>
do
    <cmd> # 测试退出状态码非 0（条件不成立）时执行
done
#+end_src

可以使用多个测试，规则同 =while= 。

#+CAPTION: 逻辑对比
|         | *条件成立* | *条件不成立* |
|---------+------------+--------------|
| =while= | 运行命令   | 不运行命令   |
|---------+------------+--------------|
| =until= | 不运行命令 | 运行命令     |

** =break= =continue=

#+begin_src sh
break <n>    # 默认为 1
continue <n> # 默认为 1
#+end_src

* 函数

#+begin_src sh
foo() {
    echo "$1" # 参数通过 $n 引用
    return 0
}
foo "bar" # 调用
#+end_src

* 参数

#+begin_src sh
./script -a -b param1 -c -d -- param2 param3
    -a     # 选项
    param1 # 选项参数
    param2 # 额外参数
#+end_src

