programming/linux/shell_scripting.html
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Glob 表达式</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Shell 使用的、简化了的正则表达式。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>*</code></th>
<th scope="col" class="left">任意个任意字符</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>?</code></td>
<td class="left">任意一个字符</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>[&lt;char&gt;...]</code></td>
<td class="left">多个字符中任意一个</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>[&lt;from&gt;-&lt;to&gt;]</code></td>
<td class="left">范围内的字符</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>\</code></td>
<td class="left">转义字符</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 语句</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <code>if</code></h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">if</span> [ &lt;cond&gt; ]
<span class="org-keyword">then</span>
    ... <span class="org-comment-delimiter"># </span><span class="org-comment">if &#21629;&#20196;&#30340;&#36864;&#20986;&#29366;&#24577;&#30721;&#20026; 0</span>
<span class="org-keyword">elif</span> [ &lt;cond&gt; ]
<span class="org-keyword">then</span>
    ...
<span class="org-keyword">else</span>
    ... <span class="org-comment-delimiter"># </span><span class="org-comment">if &#21629;&#20196;&#30340;&#36864;&#20986;&#29366;&#24577;&#30721;&#38750; 0</span>
<span class="org-keyword">fi</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">简写</label>
<pre class="src src-sh"><span class="org-keyword">if</span> [ &lt;cond&gt; ]; <span class="org-keyword">then</span>
    ...
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <code>case</code></h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">case</span> $&lt;var&gt;<span class="org-keyword"> in</span>
&lt;val1&gt; | &lt;val2&gt;)
    &lt;cmd&gt;;;
&lt;val3&gt;)
    &lt;cmd&gt;;;
*)
    &lt;cmd&gt;;; <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;&#20998;&#25903;</span>
<span class="org-keyword">esac</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> <code>for</code></h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">for</span> &lt;var&gt;<span class="org-keyword"> in</span> &lt;list&gt;
<span class="org-keyword">do</span>
    &lt;cmd&gt;
<span class="org-keyword">done</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">简写</label>
<pre class="src src-sh"><span class="org-keyword">for</span> &lt;var&gt;<span class="org-keyword"> in</span> &lt;list&gt;; <span class="org-keyword">do</span>
    &lt;cmd&gt;
<span class="org-keyword">done</span>
</pre>
</div>
</div>

<div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> 列表</h4>
<div class="outline-text-4" id="text-5-3-1">
<div class="org-src-container">
<label class="org-src-name">直接输入</label>
<pre class="src src-sh"><span class="org-keyword">for</span> var<span class="org-keyword"> in</span> a b c d <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;&#20998;&#38548;&#31526;&#20026;&#31354;&#26684;</span>
                   <span class="org-comment-delimiter"># </span><span class="org-comment">&#21333;&#24341;&#21495;&#38656;&#35201;&#36716;&#20041;&#65292;&#25110;&#29992;&#21452;&#24341;&#21495;&#20998;&#38548;</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">从变量读取</label>
<pre class="src src-sh"><span class="org-variable-name">list</span>=<span class="org-string">'a b c d'</span>
<span class="org-keyword">for</span> var<span class="org-keyword"> in</span> $<span class="org-variable-name">list</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">从输出读取</label>
<pre class="src src-sh"><span class="org-keyword">for</span> var<span class="org-keyword"> in</span> <span class="org-sh-quoted-exec">`cat file`</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">遍历目录</label>
<pre class="src src-sh"><span class="org-keyword">for</span> file<span class="org-keyword"> in</span> path/*; <span class="org-keyword">do</span>      <span class="org-comment-delimiter"># </span><span class="org-comment">&#30446;&#24405;&#65288;&#25991;&#20214;&#65289;&#21015;&#34920;&#20351;&#29992; glob &#34920;&#36798;&#24335;</span>
    <span class="org-keyword">if</span> [ -d <span class="org-string">"$file"</span> ]; <span class="org-keyword">then</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#25991;&#20214;&#21517;&#20013;&#21487;&#33021;&#26377;&#31354;&#26684;&#65292;&#38656;&#29992;&#24341;&#21495;&#20998;&#38548;</span>

<span class="org-keyword">for</span> file<span class="org-keyword"> in</span> path1/* path2/* <span class="org-comment-delimiter"># </span><span class="org-comment">&#21487;&#20197;&#20351;&#29992;&#22810;&#20010;&#34920;&#36798;&#24335;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> C 风格 <code>for</code></h4>
<div class="outline-text-4" id="text-5-3-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">for</span> (( &lt;var&gt;=&lt;start&gt;; &lt;cond&gt;; &lt;iter&gt; ))
<span class="org-comment-delimiter">## </span><span class="org-comment">&#31034;&#20363;</span>
<span class="org-keyword">for</span> (( <span class="org-variable-name">i</span>=1; i&lt;=10; i++ ))
</pre>
</div>

<ul class="org-ul">
<li>给变量赋值可以有空格。
</li>
<li>条件中的变量不以 <code>$</code> 开头。
</li>
<li>迭代过程不是 <code>expr</code> 表达式格式。
</li>
</ul>

<div class="org-src-container">
<label class="org-src-name">可以使用多个变量，但条件只能有一个：</label>
<pre class="src src-sh"><span class="org-keyword">for</span> (( <span class="org-variable-name">a</span>=1, <span class="org-variable-name">b</span>=10; a&lt;=10; a++, b-- ))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3"><span class="section-number-4">5.3.3</span> 重定向输出</h4>
<div class="outline-text-4" id="text-5-3-3">
<div class="org-src-container">
<label class="org-src-name">结果重定向到文件：</label>
<pre class="src src-sh"><span class="org-keyword">for</span> ...
...
<span class="org-keyword">done</span> &gt; file
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-4" class="outline-4">
<h4 id="sec-5-3-4"><span class="section-number-4">5.3.4</span> 示例</h4>
<div class="outline-text-4" id="text-5-3-4">
<div class="org-src-container">
<label class="org-src-name">数值补齐，0 到 10 补齐两位：</label>
<pre class="src src-sh"><span class="org-keyword">for</span> i<span class="org-keyword"> in</span> $(seq -f <span class="org-string">"%02g"</span> 0 10)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <code>while</code></h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">while</span> [&lt;cond&gt;]
<span class="org-keyword">do</span>
    &lt;cmd&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#27979;&#35797;&#36864;&#20986;&#29366;&#24577;&#30721;&#20026; 0 &#26102;&#25191;&#34892;</span>
<span class="org-keyword">done</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">使用多个测试</label>
<pre class="src src-sh"><span class="org-keyword">while</span> [&lt;cond&gt;]
    &lt;cond&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#27599;&#20010;&#27979;&#35797;&#21333;&#29420;&#19968;&#34892;</span>
</pre>
</div>

<ul class="org-ul">
<li>只有最后一个测试的退出状态码会被用来判断循环的结束。
</li>
<li>每次（包括最后一次）循环开始时，所有测试命令都会被执行。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> <code>until</code></h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">until</span> &lt;cond&gt;
<span class="org-keyword">do</span>
    &lt;cmd&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#27979;&#35797;&#36864;&#20986;&#29366;&#24577;&#30721;&#38750; 0&#65288;&#26465;&#20214;&#19981;&#25104;&#31435;&#65289;&#26102;&#25191;&#34892;</span>
<span class="org-keyword">done</span>
</pre>
</div>

<p>
可以使用多个测试，规则同 <code>while</code> 。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> 逻辑对比</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left"><b>条件成立</b></th>
<th scope="col" class="left"><b>条件不成立</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>while</code></td>
<td class="left">运行命令</td>
<td class="left">不运行命令</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>until</code></td>
<td class="left">不运行命令</td>
<td class="left">运行命令</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <code>break</code> <code>continue</code></h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">break</span> &lt;n&gt;    <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;&#20026; 1</span>
<span class="org-keyword">continue</span> &lt;n&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;&#20026; 1</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 函数</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-sh">&lt;name&gt; () {
    ... <span class="org-comment-delimiter"># </span><span class="org-comment">&#21442;&#25968;&#36890;&#36807; $1, $2... &#24341;&#29992;</span>
    <span class="org-keyword">return</span> &lt;value&gt;
}

&lt;name&gt; &lt;arg1&gt; &lt;arg2&gt; ... <span class="org-comment-delimiter"># </span><span class="org-comment">&#35843;&#29992;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 参数</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-sh">./script -a -b param1 -c -d -- param2 param3
    -a     <span class="org-comment-delimiter"># </span><span class="org-comment">&#36873;&#39033;</span>
    param1 <span class="org-comment-delimiter"># </span><span class="org-comment">&#36873;&#39033;&#21442;&#25968;</span>
    param2 <span class="org-comment-delimiter"># </span><span class="org-comment">&#39069;&#22806;&#21442;&#25968;</span>
</pre>
</div>
</div>
