programming/linux/shell_scripting.org
** 无选项参数

| =$0=          | 脚本名                     |
| =$n= , =${n}= | 输入参数                   |
| =$#=          | 输入参数个数               |
| =$*=          | 所有输入参数，合并为一个值 |
| =$@=          | 所有输入参数，作为独立的值 |

输入参数用空格分隔，包含空格的字符串需要用 @@html:<code>""</code>@@ 包围起来

引用输入参数前，最好检查其是否存在
#+begin_src sh
if [ -n $1 ]; then
#+end_src

*** =$0=

=$0= 包含执行时输入的路径，用 =basename= 去除路径
#+begin_src sh
name=`basename $0`
#+end_src

用一个脚本，通过不同的执行命令，完成不同功能
#+begin_src sh
## 脚本名：calc
name=`basename $0`
if [ $name = "add" ]; then
    echo $[ $1 + $2 ]
elif [ $name = "min" ]; then
    echo $[ $1 - $2 ]
fi

$ ln -s calc add
$ ln -s calc min
$ ./add 1 2
3
$ ./min 2 1
1
#+end_src

*** =$n= , =${n}=

| =$n=   | 1 <= n <=9 |
| =${n}= | n > 9   |

*** =$#=

检验参数总数
#+begin_src sh
if [ $# -ne 2 ]; then
    echo Param not correct
#+end_src

引用最后一个参数
#+begin_src sh
echo ${!#} # {} 内不可以用 $
#+end_src

当没有输入参数时， =${!#}= 是脚本名

*** =$*= , =$@=

#+begin_src sh
for param in $*; do
    echo $param
done
for param in $@; do
    echo $param
done

$ ./test a b c
a b c
a
b
c
#+end_src

** =shift=

#+begin_src sh
shift <n> # 默认为 1
#+end_src

执行 =shift= 命令后
- =$n-1= 将对应之前的 =$n= 的值
- =$n-1= 原本的值会被丢弃
- =$0= 不变

在不知道个数的情况下遍历输入参数，即只操作 =$1=
#+begin_src sh
while [ -n "$1" ]; do
    echo $1
    shift
done
#+end_src

=shift= 后数字不为 1 时，一次进行多位参数移动

** 简单选项

将选项当做参数处理，检查是否是预期的选项之一
#+begin_src sh
while [ -n "$1" ]; do
    case $1 in
    -a) ...
    *) ...
    esca
    shift
done
#+end_src

处理带参数选项
#+begin_src sh
while [ -n "$1" ]; do
    case $1 in
    -a) ...
    -b) param="$2" # 预期带一个参数的选项
        shift 2;;
    ...
    esac
    shift
done
$ ./test -a -b value
#+end_src

** 额外参数

用 =--= 分离选项和参数部分
#+begin_src sh
while [ -n "$1" ]; do
    case $1 in
    -a) ...
    --) shift
        break ;; # 跳出之前移位一次
    *) ...
    esca
    shift
done
for param in $@; do # 处理剩余部分，即额外参数
#+end_src

** =getopt=

#+begin_src sh
getopt <options> <optstring> <params>
    -q # 忽略错误消息
#+end_src

=getopt= 解析输入参数列表，以容易处理的格式输出
- 识别有效的选项，无效选项会输出错误消息
- 识别选项的参数
- 将合并的选项拆分
- 将额外参数分离出来

=<optstring>= 定义：
- 有效的选项字母
- 哪些选项预期有参数，选项字母后加 =:=

#+begin_src sh
$ getopt ab:cd -a -b v1 -cd v2 v3
-a -b v1 -c -d -- v2 v3 # 解析结果
#+end_src

脚本中使用 =getopt= 处理输入参数列表
#+begin_src sh
set -- `getopt -q ab:cd "$@"`
#+end_src

getopt 不能处理双引号内带空格的参数，会按照空格分隔开（需要 =getopts= 解决这个问题 ）

** =getopts=

#+begin_src sh
getopts <optstring> <var>
#+end_src

一次处理一个输入选项（和参数）
- 选项保存在 =<var>= ；
- 选项的参数保存在 =OPTARG= 环境变量；
- 已处理的选项（和参数）个数保存在 =OPTIND= 环境变量；
- 可以识别双引号内包含空格的参数；
- 选项字母和参数值之间可以不加空格，eg. =-a1= ；

=<optstring>= 语法同 =getopt=
- 以 =:= 开头可以忽略错误消息；
- 未定义的选项字母会转化成 =?= ；

#+begin_src sh
while getopts :ab:c opt
do
    case "$opt" in
    a) ...             # getopts 会移除选项前的 -
    b) echo $OPTARG ;;
    ...
    esac
done
#+end_src

=OPTIND= 可以用于识别额外参数开始的位置
#+begin_src sh
while getopts :ab:c opt
...
done
shift $[ $OPTIND - 1 ] # 移位到额外参数的位置
for param in "$@"
#+end_src

