programming/linux/shell_scripting.html

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 无选项参数</h3>
<div class="outline-text-3" id="text-7-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>$0</code></td>
<td class="left">脚本名</td>
</tr>

<tr>
<td class="left"><code>$n</code> , <code>${n}</code></td>
<td class="left">输入参数</td>
</tr>

<tr>
<td class="left"><code>$#</code></td>
<td class="left">输入参数个数</td>
</tr>

<tr>
<td class="left"><code>$*</code></td>
<td class="left">所有输入参数，合并为一个值</td>
</tr>

<tr>
<td class="left"><code>$@</code></td>
<td class="left">所有输入参数，作为独立的值</td>
</tr>
</tbody>
</table>

<p>
输入参数用空格分隔，包含空格的字符串需要用 <code>""</code> 包围起来
</p>

<p>
引用输入参数前，最好检查其是否存在
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">if</span> [ -n $<span class="org-variable-name">1</span> ]; <span class="org-keyword">then</span>
</pre>
</div>
</div>

<div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> <code>$0</code></h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
<code>$0</code> 包含执行时输入的路径，用 <code>basename</code> 去除路径
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-variable-name">name</span>=<span class="org-sh-quoted-exec">`basename $0`</span>
</pre>
</div>

<p>
用一个脚本，通过不同的执行命令，完成不同功能
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">## </span><span class="org-comment">&#33050;&#26412;&#21517;&#65306;calc</span>
<span class="org-variable-name">name</span>=<span class="org-sh-quoted-exec">`basename $0`</span>
<span class="org-keyword">if</span> [ $<span class="org-variable-name">name</span> = <span class="org-string">"add"</span> ]; <span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> $[ $<span class="org-variable-name">1</span> + $<span class="org-variable-name">2</span> ]
<span class="org-keyword">elif</span> [ $<span class="org-variable-name">name</span> = <span class="org-string">"min"</span> ]; <span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> $[ $<span class="org-variable-name">1</span> - $<span class="org-variable-name">2</span> ]
<span class="org-keyword">fi</span>

$ ln -s calc add
$ ln -s calc min
$ ./add 1 2
3
$ ./min 2 1
1
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-1-2" class="outline-4">
<h4 id="sec-7-1-2"><span class="section-number-4">7.1.2</span> <code>$n</code> , <code>${n}</code></h4>
<div class="outline-text-4" id="text-7-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>$n</code></td>
<td class="left">1 &lt;= n &lt;=9</td>
</tr>

<tr>
<td class="left"><code>${n}</code></td>
<td class="left">n &gt; 9</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-7-1-3" class="outline-4">
<h4 id="sec-7-1-3"><span class="section-number-4">7.1.3</span> <code>$#</code></h4>
<div class="outline-text-4" id="text-7-1-3">
<p>
检验参数总数
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">if</span> [ $<span class="org-variable-name">#</span> -ne 2 ]; <span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> Param not correct
</pre>
</div>

<p>
引用最后一个参数
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">echo</span> ${<span class="org-variable-name">!</span>#} <span class="org-comment-delimiter"># </span><span class="org-comment">{} &#20869;&#19981;&#21487;&#20197;&#29992; $</span>
</pre>
</div>

<p>
当没有输入参数时， <code>${!#}</code> 是脚本名
</p>
</div>
</div>
<div id="outline-container-sec-7-1-4" class="outline-4">
<h4 id="sec-7-1-4"><span class="section-number-4">7.1.4</span> <code>$*</code> , <code>$@</code></h4>
<div class="outline-text-4" id="text-7-1-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">for</span> param<span class="org-keyword"> in</span> $<span class="org-variable-name">*</span>; <span class="org-keyword">do</span>
    <span class="org-builtin">echo</span> $<span class="org-variable-name">param</span>
<span class="org-keyword">done</span>
<span class="org-keyword">for</span> param<span class="org-keyword"> in</span> $<span class="org-variable-name">@</span>; <span class="org-keyword">do</span>
    <span class="org-builtin">echo</span> $<span class="org-variable-name">param</span>
<span class="org-keyword">done</span>

$ ./test a b c
a b c
a
b
c
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> <code>shift</code></h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">shift</span> &lt;n&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#40664;&#35748;&#20026; 1</span>
</pre>
</div>

<p>
执行 <code>shift</code> 命令后
</p>
<ul class="org-ul">
<li><code>$n-1</code> 将对应之前的 <code>$n</code> 的值
</li>
<li><code>$n-1</code> 原本的值会被丢弃
</li>
<li><code>$0</code> 不变
</li>
</ul>

<p>
在不知道个数的情况下遍历输入参数，即只操作 <code>$1</code>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">while</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">do</span>
    <span class="org-builtin">echo</span> $<span class="org-variable-name">1</span>
    <span class="org-builtin">shift</span>
<span class="org-keyword">done</span>
</pre>
</div>

<p>
<code>shift</code> 后数字不为 1 时，一次进行多位参数移动
</p>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 简单选项</h3>
<div class="outline-text-3" id="text-7-3">
<p>
将选项当做参数处理，检查是否是预期的选项之一
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">while</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">do</span>
    <span class="org-keyword">case</span> $<span class="org-variable-name">1</span><span class="org-keyword"> in</span>
    -a) ...
    *) ...
    esca
    <span class="org-builtin">shift</span>
<span class="org-keyword">done</span>
</pre>
</div>

<p>
处理带参数选项
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">while</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">do</span>
    <span class="org-keyword">case</span> $<span class="org-variable-name">1</span><span class="org-keyword"> in</span>
    -a) ...
    -b) <span class="org-variable-name">param</span>=<span class="org-string">"$2"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#39044;&#26399;&#24102;&#19968;&#20010;&#21442;&#25968;&#30340;&#36873;&#39033;</span>
        <span class="org-builtin">shift</span> 2;;
    ...
    <span class="org-keyword">esac</span>
    <span class="org-builtin">shift</span>
<span class="org-keyword">done</span>
$ ./test -a -b value
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 额外参数</h3>
<div class="outline-text-3" id="text-7-4">
<p>
用 <code>--</code> 分离选项和参数部分
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">while</span> [ -n <span class="org-string">"$1"</span> ]; <span class="org-keyword">do</span>
    <span class="org-keyword">case</span> $<span class="org-variable-name">1</span><span class="org-keyword"> in</span>
    -a) ...
    --) <span class="org-builtin">shift</span>
        <span class="org-keyword">break</span> ;; <span class="org-comment-delimiter"># </span><span class="org-comment">&#36339;&#20986;&#20043;&#21069;&#31227;&#20301;&#19968;&#27425;</span>
    *) ...
    esca
    <span class="org-builtin">shift</span>
<span class="org-keyword">done</span>
<span class="org-keyword">for</span> param<span class="org-keyword"> in</span> $<span class="org-variable-name">@</span>; <span class="org-keyword">do</span> <span class="org-comment-delimiter"># </span><span class="org-comment">&#22788;&#29702;&#21097;&#20313;&#37096;&#20998;&#65292;&#21363;&#39069;&#22806;&#21442;&#25968;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> <code>getopt</code></h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">

<pre class="src src-sh">getopt &lt;options&gt; &lt;optstring&gt; &lt;params&gt;
    -q <span class="org-comment-delimiter"># </span><span class="org-comment">&#24573;&#30053;&#38169;&#35823;&#28040;&#24687;</span>
</pre>
</div>

<p>
<code>getopt</code> 解析输入参数列表，以容易处理的格式输出
</p>
<ul class="org-ul">
<li>识别有效的选项，无效选项会输出错误消息
</li>
<li>识别选项的参数
</li>
<li>将合并的选项拆分
</li>
<li>将额外参数分离出来
</li>
</ul>

<p>
<code>&lt;optstring&gt;</code> 定义：
</p>
<ul class="org-ul">
<li>有效的选项字母
</li>
<li>哪些选项预期有参数，选项字母后加 <code>:</code>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">$ getopt ab:cd -a -b v1 -cd v2 v3
-a -b v1 -c -d -- v2 v3 <span class="org-comment-delimiter"># </span><span class="org-comment">&#35299;&#26512;&#32467;&#26524;</span>
</pre>
</div>

<p>
脚本中使用 <code>getopt</code> 处理输入参数列表
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">set</span> -- <span class="org-sh-quoted-exec">`getopt -q ab:cd "$@"`</span>
</pre>
</div>

<p>
getopt 不能处理双引号内带空格的参数，会按照空格分隔开（需要 <code>getopts</code> 解决这个问题 ）
</p>
</div>
</div>
<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> <code>getopts</code></h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">getopts</span> &lt;optstring&gt; &lt;var&gt;
</pre>
</div>

<p>
一次处理一个输入选项（和参数）
</p>
<ul class="org-ul">
<li>选项保存在 <code>&lt;var&gt;</code> ；
</li>
<li>选项的参数保存在 <code>OPTARG</code> 环境变量；
</li>
<li>已处理的选项（和参数）个数保存在 <code>OPTIND</code> 环境变量；
</li>
<li>可以识别双引号内包含空格的参数；
</li>
<li>选项字母和参数值之间可以不加空格，eg. <code>-a1</code> ；
</li>
</ul>

<p>
<code>&lt;optstring&gt;</code> 语法同 <code>getopt</code>
</p>
<ul class="org-ul">
<li>以 <code>:</code> 开头可以忽略错误消息；
</li>
<li>未定义的选项字母会转化成 <code>?</code> ；
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">while </span><span class="org-builtin">getopts</span> :ab:c opt
<span class="org-keyword">do</span>
    <span class="org-keyword">case</span> <span class="org-string">"$opt"</span><span class="org-keyword"> in</span>
    a) ...             <span class="org-comment-delimiter"># </span><span class="org-comment">getopts &#20250;&#31227;&#38500;&#36873;&#39033;&#21069;&#30340; -</span>
    b) <span class="org-builtin">echo</span> $<span class="org-variable-name">OPTARG</span> ;;
    ...
    <span class="org-keyword">esac</span>
<span class="org-keyword">done</span>
</pre>
</div>

<p>
<code>OPTIND</code> 可以用于识别额外参数开始的位置
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">while </span><span class="org-builtin">getopts</span> :ab:c opt
...
<span class="org-keyword">done</span>
<span class="org-builtin">shift</span> $[ $<span class="org-variable-name">OPTIND</span> - 1 ] <span class="org-comment-delimiter"># </span><span class="org-comment">&#31227;&#20301;&#21040;&#39069;&#22806;&#21442;&#25968;&#30340;&#20301;&#32622;</span>
<span class="org-keyword">for</span> param<span class="org-keyword"> in</span> <span class="org-string">"$@"</span>
</pre>
</div>
</div>
</div>
