programming/linux/shell_scripting.org
** 标准化选项

| =-a= , =--all=         | 所有对象               |
|------------------------+------------------------|
| =-c= , =--count=       | 计数                   |
|------------------------+------------------------|
| =-d= , =--directory=   | 指定一个目录           |
|------------------------+------------------------|
| =-e= , =--extend=      | 扩展一个对象           |
|------------------------+------------------------|
| =-f= , =--file=        | 指定（输入）文件       |
|------------------------+------------------------|
| =-h= , =--help=        | 帮助                   |
|------------------------+------------------------|
| =-i= , =--insensitive= | 大小写不敏感           |
|------------------------+------------------------|
| =-l= , =--long=        | 长格式版本             |
|------------------------+------------------------|
| =-n=                   | 非交互模式（批量操作） |
|------------------------+------------------------|
| =-o= , =--output=      | 指定输出文件           |
|------------------------+------------------------|
| =-q= , =--quiet=       | 安静模式               |
|------------------------+------------------------|
| =-r= , =--recursive=   | 递归模式               |
|------------------------+------------------------|
| =-s= , =--silent=      | 安静模式               |
|------------------------+------------------------|
| =-v= , =--verbose=     | 详细输出               |
|------------------------+------------------------|
| =-x= , =--exclude=     | 排除                   |
|------------------------+------------------------|
| =-y= , =--yes=         | 对所有问题回答 yes     |

* 输入
** =read= 标准输入

=read= 将输入保存在变量中。

#+begin_src sh
read <options> <var> ...
    -p <string> # 提示文本
    -t <second> # 最大等待输入的时间，未输入会返回非零状态码
    -n <int>    # 最大输入字符数，到达预设数量后不再接收输入
    -s          # 隐藏用户输入（实际上是文本和背景色一样）
#+end_src

#+ATTR_HTML: :class no-border
| *指定多个变量名：* | 输入（空格分隔）和变量一一对应 |
|                    | 剩余的输入保存在最后一个变量中 |
|--------------------+--------------------------------|
| *不指定变量名：*   | 输入保存在 =REPLY= 环境变量中  |

#+CAPTION: 示例
#+begin_src sh
echo "Enter your name: "
read name
echo "Hello $name."

## -p
read -p "Enter your name: " name

## -t
if read -t 5 input; do
    ...
else
    echo "Empty input"
fi

## -n
read -n 1 -p "Do you want to continue [Y/N]? " answer
case $answer in
Y | y) ...
N | n) ...
esac
#+end_src

** 文件输入

#+CAPTION: 每次读取一行
#+begin_src sh
cat file | while read line
do
    echo $line
done
#+end_src

** =/dev/tty=

=/dev/tty= 打开时，会被自动重定向到一个终端窗口，可以用于读取人工输入。

#+begin_src sh
printf "Enter new password: "
stty -echo               # 关闭自动打印输入字符
read password < /dev/tty # 从终端读取输入
printf "\n"
stty echo                # 打开自动打印输入字符
#+end_src

* 输出
** =echo=

#+begin_src sh
echo <options> <string>
    <string> # 可以不加引号
    -e       # 识别 \ 转义字符
    -n       # 结尾不换行
#+end_src

输出 tab 分割的行到文件
#+begin_src sh
echo -e "$val1\t$val2\t$val3" >> file
#+end_src

** =printf=

#+begin_src sh
printf "<pattern>" <value>
#+end_src

* 运算
** =expr=

#+begin_src sh
expr <expr>
#+end_src

#+CAPTION: 示例
#+begin_src sh
expr 1 + 1
#+end_src

一些运算符需要 =\= 转义，如 =|= =>= 。

** =bc=

Bash 数学运算符只支持整数运算，浮点运算需要使用内建计算器 =bc= 。 =bc= 可以将浮点值作为字符串存储进变量，但结果只能用 =echo= 显示，无法在基于数字的命令中工作，如数值比较。

#+begin_src sh
echo "<options>; <expr>" | bc <options>
#+end_src

#+CAPTION: 示例
#+begin_src sh
var=`echo "scale=4; 3.44 / 5" | bc`
var=`printf ".0f" $(echo "scale=2; $a * $b / 100" | bc)`
#+end_src

* 重定向

Linux 将每个对象都当做文件处理，包括输入和输出。

** 文件描述符

- 唯一地标示会话中打开的文件对象；
- 每个过程一次最多可以有 9 个文件描述符；

bash 保留的文件描述符
|   |          | 默认位置 |
|---+----------+----------|
| 0 | =STDIN=  | 键盘     |
|---+----------+----------|
| 1 | =STDOUT= | 显示器   |
|---+----------+----------|
| 2 | =STDERR= | 显示器   |

