programming/linux/shell_scripting.html
<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> 标准化选项</h3>
<div class="outline-text-3" id="text-7-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>-a</code> , <code>--all</code></th>
<th scope="col" class="left">所有对象</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>-c</code> , <code>--count</code></td>
<td class="left">计数</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-d</code> , <code>--directory</code></td>
<td class="left">指定一个目录</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-e</code> , <code>--extend</code></td>
<td class="left">扩展一个对象</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-f</code> , <code>--file</code></td>
<td class="left">指定（输入）文件</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-h</code> , <code>--help</code></td>
<td class="left">帮助</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-i</code> , <code>--insensitive</code></td>
<td class="left">大小写不敏感</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-l</code> , <code>--long</code></td>
<td class="left">长格式版本</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-n</code></td>
<td class="left">非交互模式（批量操作）</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-o</code> , <code>--output</code></td>
<td class="left">指定输出文件</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-q</code> , <code>--quiet</code></td>
<td class="left">安静模式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-r</code> , <code>--recursive</code></td>
<td class="left">递归模式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-s</code> , <code>--silent</code></td>
<td class="left">安静模式</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-v</code> , <code>--verbose</code></td>
<td class="left">详细输出</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-x</code> , <code>--exclude</code></td>
<td class="left">排除</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>-y</code> , <code>--yes</code></td>
<td class="left">对所有问题回答 yes</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 输入</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> <code>read</code> 标准输入</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<code>read</code> 将输入保存在变量中。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">read</span> &lt;options&gt; &lt;var&gt; ...
    -p &lt;string&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#25552;&#31034;&#25991;&#26412;</span>
    -t &lt;second&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#26368;&#22823;&#31561;&#24453;&#36755;&#20837;&#30340;&#26102;&#38388;&#65292;&#26410;&#36755;&#20837;&#20250;&#36820;&#22238;&#38750;&#38646;&#29366;&#24577;&#30721;</span>
    -n &lt;int&gt;    <span class="org-comment-delimiter"># </span><span class="org-comment">&#26368;&#22823;&#36755;&#20837;&#23383;&#31526;&#25968;&#65292;&#21040;&#36798;&#39044;&#35774;&#25968;&#37327;&#21518;&#19981;&#20877;&#25509;&#25910;&#36755;&#20837;</span>
    -s          <span class="org-comment-delimiter"># </span><span class="org-comment">&#38544;&#34255;&#29992;&#25143;&#36755;&#20837;&#65288;&#23454;&#38469;&#19978;&#26159;&#25991;&#26412;&#21644;&#32972;&#26223;&#33394;&#19968;&#26679;&#65289;</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>指定多个变量名：</b></th>
<th scope="col" class="left">输入（空格分隔）和变量一一对应</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">剩余的输入保存在最后一个变量中</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>不指定变量名：</b></td>
<td class="left">输入保存在 <code>REPLY</code> 环境变量中</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-sh"><span class="org-builtin">echo</span> <span class="org-string">"Enter your name: "</span>
<span class="org-builtin">read</span> name
<span class="org-builtin">echo</span> <span class="org-string">"Hello $name."</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">-p</span>
<span class="org-builtin">read</span> -p <span class="org-string">"Enter your name: "</span> name

<span class="org-comment-delimiter">## </span><span class="org-comment">-t</span>
<span class="org-keyword">if </span><span class="org-builtin">read</span> -t 5 input; <span class="org-keyword">do</span>
    ...
<span class="org-keyword">else</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Empty input"</span>
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">-n</span>
<span class="org-builtin">read</span> -n 1 -p <span class="org-string">"Do you want to continue [Y/N]? "</span> answer
<span class="org-keyword">case</span> $<span class="org-variable-name">answer</span><span class="org-keyword"> in</span>
Y | y) ...
N | n) ...
<span class="org-keyword">esac</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 文件输入</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<label class="org-src-name">每次读取一行</label>
<pre class="src src-sh">cat file | <span class="org-keyword">while </span><span class="org-builtin">read</span> line
<span class="org-keyword">do</span>
    <span class="org-builtin">echo</span> $<span class="org-variable-name">line</span>
<span class="org-keyword">done</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> <code>/dev/tty</code></h3>
<div class="outline-text-3" id="text-8-3">
<p>
<code>/dev/tty</code> 打开时，会被自动重定向到一个终端窗口，可以用于读取人工输入。
</p>

<div class="org-src-container">

<pre class="src src-sh">printf <span class="org-string">"Enter new password: "</span>
stty -echo               <span class="org-comment-delimiter"># </span><span class="org-comment">&#20851;&#38381;&#33258;&#21160;&#25171;&#21360;&#36755;&#20837;&#23383;&#31526;</span>
<span class="org-builtin">read</span> password &lt; /dev/tty <span class="org-comment-delimiter"># </span><span class="org-comment">&#20174;&#32456;&#31471;&#35835;&#21462;&#36755;&#20837;</span>
printf <span class="org-string">"\n"</span>
stty echo                <span class="org-comment-delimiter"># </span><span class="org-comment">&#25171;&#24320;&#33258;&#21160;&#25171;&#21360;&#36755;&#20837;&#23383;&#31526;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 输出</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> <code>echo</code></h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">echo</span> &lt;options&gt; &lt;string&gt;
    &lt;string&gt; <span class="org-comment-delimiter"># </span><span class="org-comment">&#21487;&#20197;&#19981;&#21152;&#24341;&#21495;</span>
    -e       <span class="org-comment-delimiter"># </span><span class="org-comment">&#35782;&#21035; \ &#36716;&#20041;&#23383;&#31526;</span>
    -n       <span class="org-comment-delimiter"># </span><span class="org-comment">&#32467;&#23614;&#19981;&#25442;&#34892;</span>
</pre>
</div>

<p>
输出 tab 分割的行到文件
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">echo</span> -e <span class="org-string">"$val1\t$val2\t$val3"</span> &gt;&gt; file
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> <code>printf</code></h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">

<pre class="src src-sh">printf <span class="org-string">"&lt;pattern&gt;"</span> &lt;value&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 运算</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> <code>expr</code></h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">

<pre class="src src-sh">expr &lt;expr&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-sh">expr 1 + 1
</pre>
</div>

<p>
一些运算符需要 <code>\</code> 转义，如 <code>|</code> <code>&gt;</code> 。
</p>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> <code>bc</code></h3>
<div class="outline-text-3" id="text-10-2">
<p>
Bash 数学运算符只支持整数运算，浮点运算需要使用内建计算器 <code>bc</code> 。 <code>bc</code> 可以将浮点值作为字符串存储进变量，但结果只能用 <code>echo</code> 显示，无法在基于数字的命令中工作，如数值比较。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">echo</span> <span class="org-string">"&lt;options&gt;; &lt;expr&gt;"</span> | bc &lt;options&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-sh"><span class="org-variable-name">var</span>=<span class="org-sh-quoted-exec">`echo "scale=4; 3.44 / 5" | bc`</span>
<span class="org-variable-name">var</span>=<span class="org-sh-quoted-exec">`printf ".0f" $(echo "scale=2; $a * $b / 100" | bc)`</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 重定向</h2>
<div class="outline-text-2" id="text-11">
<p>
Linux 将每个对象都当做文件处理，包括输入和输出。
</p>
</div>

<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> 文件描述符</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>唯一地标示会话中打开的文件对象；
</li>
<li>每个过程一次最多可以有 9 个文件描述符；
</li>
</ul>

<p>
bash 保留的文件描述符
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">默认位置</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">0</td>
<td class="left"><code>STDIN</code></td>
<td class="left">键盘</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><code>STDOUT</code></td>
<td class="left">显示器</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">2</td>
<td class="left"><code>STDERR</code></td>
<td class="left">显示器</td>
</tr>
</tbody>
</table>
</div>
</div>
