programming/linux/shell_scripting.org
** 简单重定向

| =<=  | 重定向 =STDIN=              |
|------+-----------------------------|
| =>=  | 重定向 =STDOUT= ，覆盖      |
|------+-----------------------------|
| =>>= | 重定向 =STDOUT= ，追加      |
|------+-----------------------------|
| =2>= | 重定向 =STDERR=             |
|------+-----------------------------|
| =&>= | 重定向 =STDOUT= 和 =STDERR= |

=STDERR= 比 =STDOUT= 优先级高，合并重定向时 =STDERR= 输出在前

脚本中，临时重定向
#+begin_src sh
echo '...' >&2
#+end_src

** =exec= 重定向

=exec= 设置的重定向在脚本执行期间一直有效。

标准文件描述符
#+begin_src sh
exec 1>file
exec 2>log

exec 0< file
while read line
...
#+end_src

自定义文件描述符
#+begin_src sh
exec 3>file
echo '...' >&3
#+end_src

文件描述符之间切换
#+begin_src sh
exec 3>&1   # 3 指向显示器（默认标准输出）
exec 1>file # 标准输出指向文件
echo '...'  # 输出到文件
exec 1>&3   # 标准输出指回显示器
echo '...'  # 输出到显示器

exec 4<&0       # 4 指向键盘（默认标准输入）
exec 0< file    # 标准输入指向文件
while read line # 从文件输入
...
exec 0<&4       # 标准输入指回
read ...        # 从键盘输入
#+end_src

读写文件描述符：
- 将同一个文件描述符作为输入和输出；
- 读写操作会从 shell 维护的文件指针的位置进行，容易造成混乱；
#+begin_src sh
exec 3<> file
#+end_src

关闭文件描述符（关闭之后再次使用会报错）
#+begin_src sh
exec 3>&-
#+end_src

** =tee=

将输出重定向到指定文件，同时不影响 =STDOUT= ， =STDOUT= 依旧输出。
#+begin_src sh
tee <options> <file>
    -a, --append
#+end_src

** =/dev/null=

将输出重定向到 =/dev/null= ，数据会被丢弃。

获得命令的状态码，而忽略所有输出和错误信息。
#+begin_src sh
if grep text file > /dev/null
then
    echo "Found"
else
    echo "Not found"
fi
#+end_src

快速移除文件中的数据，不需要删除再创建。
#+begin_src sh
cat /dev/null > file
#+end_src

* 进程
** 作业号

shell 中每个进程分配的唯一号码，位于 =[]= 中
#+begin_src sh
## Ctrl+Z
[1]+ Stopped
$ kill -9 ...
[1]+ Killed
## 后台进程结束
[1]+ Done
#+end_src

** 信号

bash 收到 =SIGHUP= 信号
1. 将信号传给 shell 启动的所有进程（脚本）
2. 退出

bash 收到 =SIGINT= 信号
1. 将信号传给 shell 启动的所有进程（脚本）
2. 中断（内核停止分配 CPU 时间给 shell）

** =trap= 拦截信号

阻止 shell 对信号进行处理，执行本地命令
#+begin_src sh
trap <cmds> <sig>

## eg. 拦截 Ctrl+C
trap "echo 'Ctrl+C is trapped'" SIGINT SIGTERM

## eg. 拦截脚本退出
trap "echo Bye" EXIT

## eg. 移除拦截（恢复正常信号处理）
trap - EXIT
#+end_src

** 后台运行

#+begin_src sh
./script &
#+end_src

- 命令和 shell 分离，作为独立的后台进程运行；
- 后台进程绑定在终端会话上，如果会话退出，后台进程也会退出（某些终端会有提醒）；

* 示例

#+CAPTION: 批量替换文件前缀
#+begin_src sh
## Usage: rpl_pfix.sh <from_prefix> <to_prefix>
prefix1=$1
prefix2=$2
for file1 in `ls  | grep "$prefix1*"`
do
    suffix=${file1#$prefix1}
    mv $file1 $prefix2$suffix
done
#+end_src

#+CAPTION: 随机抽取文件内容
#+begin_src sh
## Usage: rand_line.sh <src_file> <number_of_lines>
## Result: random lines saved in <src_file>_rand
file=$1
for (( i=1; i<=$2; i++ )); do
    rand=$RANDOM
    head -$(($rand % `wc -l < $file` + 1)) $file | tail -1 >> ${file}_rand
done
#+end_src

#+CAPTION: 豆瓣计算书籍权重
#+begin_src sh
## 权重 = log10(点评人数) * 点评平均分
## 输入文件：点评人数\t点评平均分
## 输出文件：点评人数\t点评平均分\t权重
IFS=$'\n'
echo /dev/null > output
for line in `cat input`; do
    count=$(echo $line | cut -f1)
    score=$(echo $line | cut -f2)
    result=`echo "$count $score" | awk '{print(log($1) / log(10) * $2)}'`
    echo -e "$count\t$score\t$result" >> output
done
#+end_src
