programming/linux/shell_scripting.html
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> 简单重定向</h3>
<div class="outline-text-3" id="text-11-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>&lt;</code></th>
<th scope="col" class="left">重定向 <code>STDIN</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>&gt;</code></td>
<td class="left">重定向 <code>STDOUT</code> ，覆盖</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&gt;&gt;</code></td>
<td class="left">重定向 <code>STDOUT</code> ，追加</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>2&gt;</code></td>
<td class="left">重定向 <code>STDERR</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>&amp;&gt;</code></td>
<td class="left">重定向 <code>STDOUT</code> 和 <code>STDERR</code></td>
</tr>
</tbody>
</table>

<p>
<code>STDERR</code> 比 <code>STDOUT</code> 优先级高，合并重定向时 <code>STDERR</code> 输出在前
</p>

<p>
脚本中，临时重定向
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">echo</span> <span class="org-string">'...'</span> &gt;&amp;2
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> <code>exec</code> 重定向</h3>
<div class="outline-text-3" id="text-11-3">
<p>
<code>exec</code> 设置的重定向在脚本执行期间一直有效。
</p>

<p>
标准文件描述符
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">exec</span> 1&gt;file
<span class="org-keyword">exec</span> 2&gt;log

<span class="org-keyword">exec</span> 0&lt; file
<span class="org-keyword">while </span><span class="org-builtin">read</span> line
...
</pre>
</div>

<p>
自定义文件描述符
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">exec</span> 3&gt;file
<span class="org-builtin">echo</span> <span class="org-string">'...'</span> &gt;&amp;3
</pre>
</div>

<p>
文件描述符之间切换
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">exec</span> 3&gt;&amp;1   <span class="org-comment-delimiter"># </span><span class="org-comment">3 &#25351;&#21521;&#26174;&#31034;&#22120;&#65288;&#40664;&#35748;&#26631;&#20934;&#36755;&#20986;&#65289;</span>
<span class="org-keyword">exec</span> 1&gt;file <span class="org-comment-delimiter"># </span><span class="org-comment">&#26631;&#20934;&#36755;&#20986;&#25351;&#21521;&#25991;&#20214;</span>
<span class="org-builtin">echo</span> <span class="org-string">'...'</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986;&#21040;&#25991;&#20214;</span>
<span class="org-keyword">exec</span> 1&gt;&amp;3   <span class="org-comment-delimiter"># </span><span class="org-comment">&#26631;&#20934;&#36755;&#20986;&#25351;&#22238;&#26174;&#31034;&#22120;</span>
<span class="org-builtin">echo</span> <span class="org-string">'...'</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">&#36755;&#20986;&#21040;&#26174;&#31034;&#22120;</span>

<span class="org-keyword">exec</span> 4&lt;&amp;0       <span class="org-comment-delimiter"># </span><span class="org-comment">4 &#25351;&#21521;&#38190;&#30424;&#65288;&#40664;&#35748;&#26631;&#20934;&#36755;&#20837;&#65289;</span>
<span class="org-keyword">exec</span> 0&lt; file    <span class="org-comment-delimiter"># </span><span class="org-comment">&#26631;&#20934;&#36755;&#20837;&#25351;&#21521;&#25991;&#20214;</span>
<span class="org-keyword">while </span><span class="org-builtin">read</span> line <span class="org-comment-delimiter"># </span><span class="org-comment">&#20174;&#25991;&#20214;&#36755;&#20837;</span>
...
<span class="org-keyword">exec</span> 0&lt;&amp;4       <span class="org-comment-delimiter"># </span><span class="org-comment">&#26631;&#20934;&#36755;&#20837;&#25351;&#22238;</span>
<span class="org-builtin">read</span> ...        <span class="org-comment-delimiter"># </span><span class="org-comment">&#20174;&#38190;&#30424;&#36755;&#20837;</span>
</pre>
</div>

<p>
读写文件描述符：
</p>
<ul class="org-ul">
<li>将同一个文件描述符作为输入和输出；
</li>
<li>读写操作会从 shell 维护的文件指针的位置进行，容易造成混乱；
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">exec</span> 3&lt;&gt; file
</pre>
</div>

<p>
关闭文件描述符（关闭之后再次使用会报错）
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">exec</span> 3&gt;&amp;-
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> <code>tee</code></h3>
<div class="outline-text-3" id="text-11-4">
<p>
将输出重定向到指定文件，同时不影响 <code>STDOUT</code> ， <code>STDOUT</code> 依旧输出。
</p>
<div class="org-src-container">

<pre class="src src-sh">tee &lt;options&gt; &lt;file&gt;
    -a, --append
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-5" class="outline-3">
<h3 id="sec-11-5"><span class="section-number-3">11.5</span> <code>/dev/null</code></h3>
<div class="outline-text-3" id="text-11-5">
<p>
将输出重定向到 <code>/dev/null</code> ，数据会被丢弃。
</p>

<p>
获得命令的状态码，而忽略所有输出和错误信息。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">if</span> grep text file &gt; /dev/null
<span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Found"</span>
<span class="org-keyword">else</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Not found"</span>
<span class="org-keyword">fi</span>
</pre>
</div>

<p>
快速移除文件中的数据，不需要删除再创建。
</p>
<div class="org-src-container">

<pre class="src src-sh">cat /dev/null &gt; file
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 进程</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> 作业号</h3>
<div class="outline-text-3" id="text-12-1">
<p>
shell 中每个进程分配的唯一号码，位于 <code>[]</code> 中
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">## </span><span class="org-comment">Ctrl+Z</span>
[1]+ Stopped
$ kill -9 ...
[1]+ Killed
<span class="org-comment-delimiter">## </span><span class="org-comment">&#21518;&#21488;&#36827;&#31243;&#32467;&#26463;</span>
[1]+ Done
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> 信号</h3>
<div class="outline-text-3" id="text-12-2">
<p>
bash 收到 <code>SIGHUP</code> 信号
</p>
<ol class="org-ol">
<li>将信号传给 shell 启动的所有进程（脚本）
</li>
<li>退出
</li>
</ol>

<p>
bash 收到 <code>SIGINT</code> 信号
</p>
<ol class="org-ol">
<li>将信号传给 shell 启动的所有进程（脚本）
</li>
<li>中断（内核停止分配 CPU 时间给 shell）
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> <code>trap</code> 拦截信号</h3>
<div class="outline-text-3" id="text-12-3">
<p>
阻止 shell 对信号进行处理，执行本地命令
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">trap</span> &lt;cmds&gt; &lt;sig&gt;

<span class="org-comment-delimiter">## </span><span class="org-comment">eg. &#25318;&#25130; Ctrl+C</span>
<span class="org-keyword">trap</span> <span class="org-string">"echo 'Ctrl+C is trapped'"</span> SIGINT SIGTERM

<span class="org-comment-delimiter">## </span><span class="org-comment">eg. &#25318;&#25130;&#33050;&#26412;&#36864;&#20986;</span>
<span class="org-keyword">trap</span> <span class="org-string">"echo Bye"</span> EXIT

<span class="org-comment-delimiter">## </span><span class="org-comment">eg. &#31227;&#38500;&#25318;&#25130;&#65288;&#24674;&#22797;&#27491;&#24120;&#20449;&#21495;&#22788;&#29702;&#65289;</span>
<span class="org-keyword">trap</span> - EXIT
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> 后台运行</h3>
<div class="outline-text-3" id="text-12-4">
<div class="org-src-container">

<pre class="src src-sh">./script &amp;
</pre>
</div>

<ul class="org-ul">
<li>命令和 shell 分离，作为独立的后台进程运行；
</li>
<li>后台进程绑定在终端会话上，如果会话退出，后台进程也会退出（某些终端会有提醒）；
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 示例</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<label class="org-src-name">批量替换文件前缀</label>
<pre class="src src-sh"><span class="org-comment-delimiter">## </span><span class="org-comment">Usage: rpl_pfix.sh &lt;from_prefix&gt; &lt;to_prefix&gt;</span>
<span class="org-variable-name">prefix1</span>=$<span class="org-variable-name">1</span>
<span class="org-variable-name">prefix2</span>=$<span class="org-variable-name">2</span>
<span class="org-keyword">for</span> file1<span class="org-keyword"> in</span> <span class="org-sh-quoted-exec">`ls  | grep "$prefix1*"`</span>
<span class="org-keyword">do</span>
    <span class="org-variable-name">suffix</span>=${<span class="org-variable-name">file1</span>#$<span class="org-variable-name">prefix1</span>}
    mv $<span class="org-variable-name">file1</span> $<span class="org-variable-name">prefix2</span>$<span class="org-variable-name">suffix</span>
<span class="org-keyword">done</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">随机抽取文件内容</label>
<pre class="src src-sh"><span class="org-comment-delimiter">## </span><span class="org-comment">Usage: rand_line.sh &lt;src_file&gt; &lt;number_of_lines&gt;</span>
<span class="org-comment-delimiter">## </span><span class="org-comment">Result: random lines saved in &lt;src_file&gt;_rand</span>
<span class="org-variable-name">file</span>=$<span class="org-variable-name">1</span>
<span class="org-keyword">for</span> (( <span class="org-variable-name">i</span>=1; i&lt;=$<span class="org-variable-name">2</span>; i++ )); <span class="org-keyword">do</span>
    <span class="org-variable-name">rand</span>=$<span class="org-variable-name">RANDOM</span>
    head -$(($<span class="org-variable-name">rand</span> % <span class="org-sh-quoted-exec">`wc -l &lt; $file`</span> + 1)) $<span class="org-variable-name">file</span> | tail -1 &gt;&gt; ${<span class="org-variable-name">file</span>}_rand
<span class="org-keyword">done</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">豆瓣计算书籍权重</label>
<pre class="src src-sh"><span class="org-comment-delimiter">## </span><span class="org-comment">&#26435;&#37325; = log10(&#28857;&#35780;&#20154;&#25968;) * &#28857;&#35780;&#24179;&#22343;&#20998;</span>
<span class="org-comment-delimiter">## </span><span class="org-comment">&#36755;&#20837;&#25991;&#20214;&#65306;&#28857;&#35780;&#20154;&#25968;\t&#28857;&#35780;&#24179;&#22343;&#20998;</span>
<span class="org-comment-delimiter">## </span><span class="org-comment">&#36755;&#20986;&#25991;&#20214;&#65306;&#28857;&#35780;&#20154;&#25968;\t&#28857;&#35780;&#24179;&#22343;&#20998;\t&#26435;&#37325;</span>
<span class="org-variable-name">IFS</span>=$<span class="org-string">'\n'</span>
<span class="org-builtin">echo</span> /dev/null &gt; output
<span class="org-keyword">for</span> line<span class="org-keyword"> in</span> <span class="org-sh-quoted-exec">`cat input`</span>; <span class="org-keyword">do</span>
    <span class="org-variable-name">count</span>=$(<span class="org-builtin">echo</span> $<span class="org-variable-name">line</span> | cut -f1)
    <span class="org-variable-name">score</span>=$(<span class="org-builtin">echo</span> $<span class="org-variable-name">line</span> | cut -f2)
    <span class="org-variable-name">result</span>=<span class="org-sh-quoted-exec">`echo "$count $score" | awk '{print(log($1) / log(10) * $2)}'`</span>
    <span class="org-builtin">echo</span> -e <span class="org-string">"$count\t$score\t$result"</span> &gt;&gt; output
<span class="org-keyword">done</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-03 Sat 20:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
